In [1]:
import pandas as pd

In [4]:
df = pd.read_csv("C:/Users/Ramsha Ahmed/Documents/students.csv")

In [26]:
df.head()

   StudentID     Name    Course  Marks  Age           City
0        101    Alice    Python     85   20       New York
1        102      Bob    Python     67   21        Chicago
2        103  Charlie       SQL     74   22  San Francisco
3        104    Diana  Power BI     92   23       New York
4        105    Ethan    Python     58   20        Chicago

In [6]:
df.tail(2)

   StudentID   Name  Course  Marks  Age           City
4        105  Ethan  Python     58   20        Chicago
5        106  Fiona     SQL     81   21  San Francisco

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   StudentID  6 non-null      int64
 1   Name       6 non-null      object
 2   Course     6 non-null      object
 3   Marks      6 non-null      int64
 4   Age        6 non-null      int64
 5   City       6 non-null      object
dtypes: int64(3), object(3)
memory usage: 420.0+ bytes

In [8]:
df.describe()

        StudentID      Marks        Age
count    6.000000   6.000000   6.000000
mean   103.500000  76.166667  21.166667
std      1.870829  12.416387   1.169045
min    101.000000  58.000000  20.000000
25%    102.250000  68.750000  20.250000
50%    103.500000  77.500000  21.000000
75%    104.750000  84.000000  21.750000
max    106.000000  92.000000  23.000000

In [9]:
df.columns

Index(['StudentID', 'Name', 'Course', 'Marks', 'Age', 'City'], dtype='object')

In [10]:
df.dtypes

StudentID     int64
Name         object
Course       object
Marks         int64
Age           int64
City         object
dtype: object

In [11]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [12]:
df.sample(2)

   StudentID     Name Course  Marks  Age           City
2        103  Charlie    SQL     74   22  San Francisco
5        106    Fiona    SQL     81   21  San Francisco

In [13]:
df.shape

(6, 6)

In [14]:
print(df.sort_values(by='Marks',ascending = False))

   StudentID     Name    Course  Marks  Age           City
3        104    Diana  Power BI     92   23       New York
0        101    Alice    Python     85   20       New York
5        106    Fiona       SQL     81   21  San Francisco
2        103  Charlie       SQL     74   22  San Francisco
1        102      Bob    Python     67   21        Chicago
4        105    Ethan    Python     58   20        Chicago

In [15]:
print(df['Course'].value_counts())

Course
Python      3
SQL         2
Power BI    1
Name: count, dtype: int64

In [17]:
df['Course']

0      Python
1      Python
2         SQL
3    Power BI
4      Python
5         SQL
Name: Course, dtype: object

In [25]:
df.loc[2]

StudentID              103
Name               Charlie
Course                 SQL
Marks                   74
Age                     22
City         San Francisco
Name: 2, dtype: object

In [23]:
df.loc[2,'Course']

'SQL'

In [38]:
df.iloc[2,2]

'SQL'

In [39]:
#Access the third row and last column using .iloc

df.iloc[2,5]

'San Francisco'

In [41]:
#Access the last row and third column using .iloc

df.iloc[5,2]

'SQL'

In [44]:
#Access the third row using .loc

df.loc[2,'Marks']

np.int64(74)

In [45]:
df['City']

0         New York
1          Chicago
2    San Francisco
3         New York
4          Chicago
5    San Francisco
Name: City, dtype: object

In [48]:
print(df[df['Marks'] > 80])

   StudentID   Name    Course  Marks  Age           City
0        101  Alice    Python     85   20       New York
3        104  Diana  Power BI     92   23       New York
5        106  Fiona       SQL     81   21  San Francisco

In [52]:
print(df[df['Age'] > 20])

   StudentID     Name    Course  Marks  Age           City
1        102      Bob    Python     67   21        Chicago
2        103  Charlie       SQL     74   22  San Francisco
3        104    Diana  Power BI     92   23       New York
5        106    Fiona       SQL     81   21  San Francisco

In [53]:
print(df[(df['Marks'] > 85) & (df['Name'] != 'Bob')])

   StudentID   Name    Course  Marks  Age      City
3        104  Diana  Power BI     92   23  New York

In [54]:
print(df[(df['Marks'] < 60) & (df['City'] != 'San Francisco')])

   StudentID   Name  Course  Marks  Age     City
4        105  Ethan  Python     58   20  Chicago

In [58]:
print(df[df['Marks'] > 90]['Name'])

3    Diana
Name: Name, dtype: object

In [59]:
# Use conditional statements to filter age of students lesser than 21 and not taking python

print(df[(df['Age'] < 21) & (df['Course'] != 'Python')])

Empty DataFrame
Columns: [StudentID, Name, Course, Marks, Age, City]
Index: []